bench/rheotool/cavity_oldroydb_log_re001_de1_b05_no_ibsd/0/tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{

    movingLid
    {
        type            linearExtrapolation;
        value           uniform (0 0 0 0 0 0);
    }
    fixedWalls
    {
        type            linearExtrapolation;
        value           uniform (0 0 0 0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    
}

// ************************************************************************* //
