bench/rheotool/cavity_oldroydb_log_re001_de1_b05_no_ibsd/0/theta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    object      theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{

    movingLid
    {
        type            zeroGradient;         
    }
    fixedWalls
    {
        type            zeroGradient;         
    }
    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
