bench/rheotool/cavity_oldroydb_log_re001_de1_b05_no_ibsd/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=`getApplication`

runApplication blockMesh

runApplication $application

runApplication postProcess -func sampleDict
