bench/rheotool/cavity_oldroydb_log_re001_de1_b05_no_ibsd/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{
                
                type             Oldroyd-BLog;

                rho              rho [1 -3 0 0 0 0 0] .01;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.5;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.5;                 
                lambda           lambda [0 0 1 0 0 0 0] 1.;  

                stabilization    none;
                
}

passiveScalarProperties
{

                solvePassiveScalar   off;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
